In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('../data/retail_sales_dataset.csv')
df

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100
...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120

In [6]:
df.columns

Index(['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age',
       'Product Category', 'Quantity', 'Price per Unit', 'Total Amount'],
      dtype='object')

In [7]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [9]:
df.isna().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [10]:
ventas_por_categoría = df.groupby('Product Category')['Total Amount'].sum()

print(ventas_por_categoría)

Product Category
Beauty         143515
Clothing       155580
Electronics    156905
Name: Total Amount, dtype: int64

In [11]:
df['Product Category'].value_counts()
print(df['Product Category'].value_counts())

Product Category
Clothing       351
Electronics    342
Beauty         307
Name: count, dtype: int64

In [12]:
df['Date'] = pd.to_datetime(df['Date'])
ventas_por_dia = df.groupby(['Date', 'Product Category'])['Total Amount'].sum().reset_index()

In [13]:
print(ventas_por_dia)

          Date Product Category  Total Amount
0   2023-01-01           Beauty          1500
1   2023-01-01         Clothing          2100
2   2023-01-02           Beauty            25
3   2023-01-02         Clothing          1650
4   2023-01-02      Electronics            90
..         ...              ...           ...
650 2023-12-29           Beauty          3300
651 2023-12-29      Electronics           100
652 2023-12-31      Electronics            50
653 2024-01-01           Beauty          1500
654 2024-01-01      Electronics            30

[655 rows x 3 columns]

In [14]:
promedio_diario_por_categoría = ventas_por_dia.groupby('Product Category')['Total Amount'].mean()

In [15]:
print(promedio_diario_por_categoría)

Product Category
Beauty         703.504902
Clothing       670.603448
Electronics    716.461187
Name: Total Amount, dtype: float64

In [16]:
# Categoría con mayores ventas
ventas_max_por_categoria = ventas_por_dia.idxmax()
ventas_max_valor = ventas_por_categoría.max()

In [17]:
ventas_min_por_categoría = ventas_por_dia.idxmin()
venas_min_valor = ventas_por_categoría.min()

In [18]:
print(f"Mayor categoría con ventas: {ventas_max_por_categoria} con {ventas_por_dia}")

Mayor categoría con ventas: Date                653
Product Category      4
Total Amount        324
dtype: int64 con           Date Product Category  Total Amount
0   2023-01-01           Beauty          1500
1   2023-01-01         Clothing          2100
2   2023-01-02           Beauty            25
3   2023-01-02         Clothing          1650
4   2023-01-02      Electronics            90
..         ...              ...           ...
650 2023-12-29           Beauty          3300
651 2023-12-29      Electronics           100
652 2023-12-31      Electronics            50
653 2024-01-01           Beauty          1500
654 2024-01-01      Electronics            30

[655 rows x 3 columns]

In [19]:
total_sales_by_category = df.groupby('Product Category')['Total Amount'].sum()

print(total_sales_by_category)

Product Category
Beauty         143515
Clothing       155580
Electronics    156905
Name: Total Amount, dtype: int64

In [20]:
# Asegurarnos de que la columna 'Date' sea de tipo datetime
df['Date'] = pd.to_datetime(df['Date'])

# Agrupar por categoría y fecha, y sumar las ventas diarias
daily_sales = df.groupby(['Date', 'Product Category'])['Total Amount'].sum().reset_index()

# Calcular el promedio diario por categoría
avg_daily_sales_by_category = daily_sales.groupby('Product Category')['Total Amount'].mean()

print(avg_daily_sales_by_category)

Product Category
Beauty         703.504902
Clothing       670.603448
Electronics    716.461187
Name: Total Amount, dtype: float64

In [21]:
# Categoría con mayores ventas
ventas_max_por_categoria = total_sales_by_category.idxmax()
ventas_max_valor = total_sales_by_category.max()

# Categoría con menores ventas
ventas_min_por_categoria = total_sales_by_category.idxmin()
venas_min_valor = total_sales_by_category.min()

print(f"Mayor categoría de ventas: {ventas_max_por_categoria} con {ventas_max_valor}")
print(f"Menor categoría de ventas: {ventas_min_por_categoria} con {venas_min_valor}")

Mayor categoría de ventas: Electronics con 156905
Menor categoría de ventas: Beauty con 143515